src/cf/DataProcessors/ЗагрузчикСделокИзXML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузчикСделокИзXML</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сделки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияБрокера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияБиржи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗаявки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>25</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСделки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>25</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеСделки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.НаправлениеСделки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Счета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКлиента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КодыКлиентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/НаправлениеСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>НаправлениеСделки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/Сделка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Сделка</Name>
			<BasedOn>
				<xr:Item>Document.ПланСделки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПрибылиУбытки</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ОткрытыеПозиции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаправлениеСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправлениеСделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеМодели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТриггерВхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТриггерыВхода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланСделки</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСовершенияСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособСовершенияСделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияТестирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииТестов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияБрокера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияБиржи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтопПриказа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСделки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>25</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыСигнала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПараметрыСигналов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/Счета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Счета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчёта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/ЗагрузчикСделокИзXML/Ext/ObjectModule.bsl
#Область ЭкспортныеПроцедуры
&НаСервере
Функция ПрочитатьДанныеXML_Открытие(ПутьКФайлу) Экспорт
	
	СтруктураВозврата = Новый Структура("СообщениеОбОшибке");
	СтруктураВозврата.Вставить("Результат",Ложь);	
	ЧтениеXML = Новый ЧтениеXML();
	
	Попытка
		ЧтениеXML.ОткрытьФайл(ПутьКФайлу);	
	Исключение	
		#Если НЕ МобильноеПриложениеСервер И НЕ МобильноеПриложениеКлиент Тогда
		Ошибка = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(Ошибка,
		УровеньЖурналаРегистрации.Ошибка);	
		#КонецЕсли
		СтруктураВозврата.СообщениеОбОшибке = "Ошибка открытия файла!Подробная информация внесена в журнал регистрации.";
		Возврат СтруктураВозврата;	
	КонецПопытки;
	
	Результат = Новый Массив;
	
	ДанныеФайла = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	//TODO: Вынести в отдельную функцию поиск свойства
	Попытка	
		НомерСчёта = ДанныеФайла.Получить("client_code");	
	Исключение
		#Если НЕ МобильноеПриложениеСервер И НЕ МобильноеПриложениеКлиент Тогда
		Ошибка = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(Ошибка,
		УровеньЖурналаРегистрации.Ошибка);		
		#КонецЕсли
		СтруктураВозврата.СообщениеОбОшибке = "Ошибка формата файла!Подробная информация внесена в журнал регистрации.";
		Возврат СтруктураВозврата;	
	КонецПопытки;
	
	
	Счёт = НайтиСчётПоНомеру(НомерСчёта);
	
	
	Если Счёт = Неопределено Тогда
		СтруктураВозврата.СообщениеОбОшибке = "Не удалось однозначно идентифицировать счет!";
		Возврат СтруктураВозврата ;			
	КонецЕсли;
	
	

	
	Попытка	
		СделкиИзФайла = ДанныеФайла.Получить("common_deal");	
	Исключение
		#Если НЕ МобильноеПриложениеСервер И НЕ МобильноеПриложениеКлиент Тогда
		Ошибка = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(Ошибка,
		УровеньЖурналаРегистрации.Ошибка);
		#КонецЕсли
		СтруктураВозврата.СообщениеОбОшибке = "Ошибка формата файла!Подробная информация внесена в журнал регистрации.";
		Возврат СтруктураВозврата;	
	КонецПопытки;	
		
	
	Сделки.Очистить();
	
	Для каждого Строка Из СделкиИзФайла.item Цикл		
		
		//Проверим есть ли инструменты в базе		
		Инструмент = ПолучитьИнструментПоКороткомуКоду(Строка.security_name); 		
		Если Инструмент = Неопределено Тогда
			СтруктураВозврата.СообщениеОбОшибке = "Не удалось найти инструмент по короткому коду """ + Строка.security_name + """!";
			Возврат СтруктураВозврата ;			
		КонецЕсли;
		
		КодКлиента  = ПолучитьСоздатьКодКлиентаПоНаименованию(Строка.registration_code,Счёт);
		
				
		НоваяСтрока = Сделки.Добавить();
		НоваяСтрока.Счет = Счёт;
		НоваяСтрока.КодКлиента = КодКлиента; 
		НоваяСтрока.Инструмент = Инструмент;
		НоваяСтрока.Дата =  xmlЗначение(тип("дата"), Строка.deal_date);
		НоваяСтрока.Количество = Число(Строка.quantity);
		НоваяСтрока.Цена = Число(Строка.price);
		НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена ;
		НоваяСтрока.КомиссияБрокера =  Число(Строка.comm_trade);
		НоваяСтрока.КомиссияБиржи =   Число(Строка.comm_stock);
		НоваяСтрока.НомерЗаявки = 	Число(Строка.order_number);
		НоваяСтрока.НомерСделки =   Число(Строка.deal_number);
		НоваяСтрока.НаправлениеСделки	= ?(Число(Строка.deal_sign)>0,Перечисления.НаправлениеСделки.Продажа,Перечисления.НаправлениеСделки.Покупка) ;
	КонецЦикла;
	
	СтруктураВозврата.Вставить("Результат",Истина);
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция СоздатьДокументыСделок()Экспорт 
	
	СтруктураВозврата = Новый Структура("СообщениеОбОшибке");
	СтруктураВозврата.Вставить("Результат",Ложь);	
	Если НЕ Сделки.Количество() Тогда
		СтруктураВозврата.СообщениеОбОшибке = "Сделки не обнаружены!";	
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	
	Сделки.Сортировать("НомерЗаявки");
	
	НомерЗаявки = Неопределено;
	ДокументОбъект = Неопределено;
	
	Для каждого  Строка Из  Сделки Цикл
		
		Если ДокументОбъект = Неопределено Тогда
			ДокументОбъект = ПолучитьСоздатьДокументОбъектСделкаПоНомеруЗаявки(Строка.НомерЗаявки);				
			ЗаполнитьЗначенияСвойств(ДокументОбъект,Строка);
		КонецЕсли;
		
		Если  НЕ НомерЗаявки = Строка.НомерЗаявки и Не ДокументОбъект = Неопределено Тогда									
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ДокументОбъект = ПолучитьСоздатьДокументОбъектСделкаПоНомеруЗаявки(Строка.НомерЗаявки);	
			ЗаполнитьЗначенияСвойств(ДокументОбъект,Строка);
		КонецЕсли;
						
		НоваяСтрокаДокумента = ДокументОбъект.Параметры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента,Строка);		
		
		НомерЗаявки = Строка.НомерЗаявки;
		
	КонецЦикла;
	
	
	
	  СтруктураВозврата.Результат = Истина;
	
	Возврат СтруктураВозврата;
	
	
КонецФункции

#КонецОбласти 


&НаСервере
Функция НайтиСчётПоНомеру(НомерСчёта)
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Счета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Счета КАК Счета
	|ГДЕ
	|	Счета.НомерСчёта ПОДОБНО &НомерСчёта";
	
	Запрос.УстановитьПараметр("НомерСчёта", НомерСчёта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	    Возврат Неопределено;
	
КонецФункции // ()
&НаСервере
Функция НайтиДокументПоНомеруЗаявки(НомерЗаявки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сделка.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|ГДЕ
		|	Сделка.НомерЗаявки = &НомерЗаявки";
	
	Запрос.УстановитьПараметр("НомерЗаявки", НомерЗаявки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	 	

КонецФункции // ()
&НаСервере
Функция ПолучитьСоздатьКодКлиентаПоНаименованию(Наименование,Счёт)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КодыКлиентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КодыКлиентов КАК КодыКлиентов
	|ГДЕ
	|	КодыКлиентов.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	
	НовыйОбъект = Справочники.КодыКлиентов.СоздатьЭлемент();
	НовыйОбъект.Владелец = Счёт;
	НовыйОбъект.Наименование = Наименование;
	НовыйОбъект.Записать();
	
	Возврат НовыйОбъект.Ссылка;
	
КонецФункции // ()
&НаСервере
Функция ПолучитьСоздатьДокументОбъектСделкаПоНомеруЗаявки(НомерЗаявки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сделка.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|ГДЕ
		|	Сделка.НомерЗаявки = &НомерЗаявки";
	
	Запрос.УстановитьПараметр("НомерЗаявки", НомерЗаявки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();	
	КонецЦикла;
	
	
	Возврат Документы.Сделка.СоздатьДокумент();

	
	

КонецФункции // ()

&НаСервере
Функция ПолучитьИнструментПоКороткомуКоду(КороткийКод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Инструменты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Инструменты КАК Инструменты
		|ГДЕ
		|	Инструменты.secid = &КороткийКод";
	
	Запрос.УстановитьПараметр("КороткийКод", СокрЛП(КороткийКод));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;

	
КонецФункции // ()
